templates/execute-anonymous.xml

<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
              xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:cmd="http://soap.sforce.com/2006/08/apex"
              xmlns:apex="http://soap.sforce.com/2006/08/apex">
    <env:Header>
        <cmd:SessionHeader>
            <cmd:sessionId>%s</cmd:sessionId>
        </cmd:SessionHeader>
        <apex:DebuggingHeader><apex:debugLevel>DEBUGONLY</apex:debugLevel></apex:DebuggingHeader>
    </env:Header>
    <env:Body>
        <executeAnonymous xmlns="http://soap.sforce.com/2006/08/apex">
            <apexcode>
                <![CDATA[%s]]>
            </apexcode>
        </executeAnonymous>
    </env:Body>
</env:Envelope>